"""2. Создайте переменные разных типов данных:
  - Создайте переменную name и присвойте ей значение вашего имени (строка).
  - Выведите значение переменной name на экран.
  - Создайте переменную age и присвойте ей значение вашего возраста (целое число).
  - Выведите значение переменной age на экран.
  - Перезапишите в age текущее значение переменной age + новое.
Как неверно (просто перезапись на новое число):
a = 15
a = 17
  - Выведите измененное значение переменной age на экран.
  - Создайте переменную is_student и присвойте ей значение True (логическое значение).
  - Выведите значение переменной is_student на экран."""

name = "Mariya" #объявила переменную name, присвоила ей значение Mariya, строковый тип.
print(name) #вывела значение на экран.
age = 45  #оъявила переменную age и присвоила ей значение 45 тип - целое число
print(age) # вывела значение на экран
a = 15 #объявила пеерменную а,присвоила ей значение 15 тип - целое число
a = 17 #в переменную а поместила новое значение переменной - 17. тип - целое число.
age = age + a # в переменную age поместила новое значение суммы age+a
print(age) #вывела новое значение на консоль.
is_student = True #объявила значение переменной is_student и присвоила ей логическое значение True
print(is_student) #вывела значение переменной is_student на консоль 




